---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures
source: html/42a7a7cd-04da-fda9-c0ec-5362f9b0739f.htm
---
# BuiltInFailures.ForeignFileFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.